Repository: Brunokrk/curriculum
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Home
pt: Início

source: About
pt: Sobre

# graduation
source: Education
pt: Formação

# experiences
source: Experience
pt: Experiências

# aboutContent
source: My name is Bruno Marchi Pires, I'm 24 years old and currently live in Florianópolis. I have a degree in Computer Science from the State University of Santa Catarina (UDESC). Here, in my portfolio, you will be able to better understand my academic and professional trajectory, learn about the projects I have worked on, as well as my ambitions and future goals. I'm always open to communication and you can contact me through any of the channels available here!
pt: Me chamo Bruno Marchi Pires, tenho 24 anos e atualmente resido na cidade de Florianópolis. Sou formado em Ciência da Computação na Universidade do Estado de Santa Catarina (UDESC). Aqui, no meu portfólio, você poderá entender melhor minha trajetória acadêmica e profissional, conhecer os projetos nos quais já trabalhei, bem como minhas ambições e objetivos futuros. Estou sempre aberto à comunicação e você pode entrar em contato comigo através de qualquer um dos canais disponíveis aqui!

# graduationContent
source: I have always had a great affinity with computers and ease with logical reasoning, which led me to enroll in the Computer Science bachelor's degree in 2018. Even without prior programming experience, the academic environment proved to be highly stimulating and challenging, providing broad and in-depth learning in various areas. During my academic journey, I acquired a solid foundation in programming with the C language and evolved to object orientation with Java. From there, I explored various areas, including data analysis, evolutionary algorithms, artificial intelligence and game development with Python. I also had contact with functional languages like Haskell, in addition to exploring Web development frameworks like Angular and React. I used some relational and non-relational databases, such as MySQL, PostgreSQL and MongoDB, beyond all the scope that is inherent to a good computer science course. Currently, I dedicate myself to developing mobile solutions with Dart and Flutter. I have always sought to maintain a broad and versatile view in the technology area, testing new frameworks and languages, believing that this facilitates continuous learning of new technologies and avoids exclusive dependence on a single language or framework in building effective solutions.
pt: Sempre tive grande afinidade com computadores e facilidade com raciocínio lógico, o que me levou a ingressar no curso de bacharelado em Ciência da Computação em 2018. Mesmo sem experiência prévia em programação, o ambiente acadêmico mostrou-se altamente estimulante e desafiador, proporcionando um aprendizado amplo e aprofundado em diversas áreas. Durante minha trajetória acadêmica, adquiri uma base sólida em programação com a linguagem C e evoluí para orientação a objetos com Java. A partir daí, explorei diversas áreas, incluindo análise de dados, algoritmos evolutivos, inteligência artificial e desenvolvimento de jogos com Python. Também tive contato com linguagens funcionais como Haskell, além de explorar frameworks para desenvolvimento Web como Angular e React. Utilizei alguns bancos de dados relacionais e não-relacionais, como MySQL, PostgreSQL e MongoDB, fora todo escopo que é inerente a um bom curso de computação. Atualmente, dedico-me ao desenvolvimento de soluções mobile com Dart e Flutter. Sempre busquei manter uma visão ampla e versátil na área de tecnologia, testando novos frameworks e linguagens, acreditando que isso facilita o aprendizado contínuo de novas tecnologias e evita a dependência exclusiva de uma única linguagem ou framework na construção de soluções eficazes.

# bmptecPosition
source: Junior Mobile Software Developer
pt: Desenvolvedor de Software Mobile Júnior

# bmptecContent
source: I worked on the development of two white label applications marketed to hundreds of clients, participating in the entire development and maintenance cycle. Main activities: • Development with clean architecture, structured in layers (Data, Domain, Presentation). • Identification and correction of bugs in development and production environments. • Active participation in agile methodologies: refinements, code reviews, dailies and retrospectives. • Management of multiple applications in Google Play and App Store stores (white label model). • Contribution to technical discussions and decision-making about architecture and development patterns. Technical responsibilities: • Use of different state managers, such as GetX and Provider. • Implementation of clean architecture (contracts, use cases, services, repositories, DTOs and models). • Creation and configuration of applications in Firebase. • Integration with native operating system resources (e.g.: camera). • Firebase Push Notifications configuration. • Writing unit tests. • Use of pipelines for partner publication in stores and maintenance of the same. • Creation of scripts for automation of manual team processes.
pt: Atuei no desenvolvimento de dois aplicativos white label comercializados para centenas de clientes, participando de todo o ciclo de desenvolvimento e manutenção. Principais atividades: • Desenvolvimento com arquitetura limpa, estruturada em camadas (Data, Domain, Presentation). • Identificação e correção de bugs em ambientes de desenvolvimento e produção. • Participação ativa em metodologias ágeis: refinamentos, code reviews, dailys e retrospectivas. • Gestão de múltiplos aplicativos nas lojas Google Play e App Store (modelo white label). • Contribuição em discussões técnicas e tomadas de decisão sobre arquitetura e padrões de desenvolvimento. Responsabilidades técnicas: • Uso de diferentes gerenciadores de estado, como GetX e Provider. • Implementação de arquitetura limpa (contratos, use cases, services, repositories, DTOs e models). • Criação e configuração de aplicativos no Firebase. • Integração com recursos nativos do sistema operacional (ex.: câmera). • Configuração de Push Notifications com Firebase. • Escrita de testes unitários. • Uso de pipelines para publicação de parceiros nas lojas e manutenção das mesmas. • Criação de scripts para automatização de processos manuais do time.

# totvsPosition
source: FullStack Development Intern
pt: Estagiário em Desenvolvimento FullStack

# totvsContent
source: In the context of a team focused on the international market, I played a significant role in customizing and creating software to meet the specific needs of corporate clients for the international market. As the team's main developer in the context of Web technologies, I worked on a large-scale project focused on technological modernization, which consisted of transforming traditional desktop programs into sophisticated web applications adapted for the international market. During this period, I substantially improved my skills in using Angular and AngularJS frameworks, applying programming languages such as TypeScript and HTML to develop robust and efficient solutions. My experience also included API development using the Progress4GL language, which facilitated the integration of databases into the new web environment efficiently. Additionally, I had the opportunity to explore PO-UI, a proprietary graphical interface framework from the company, which is also made available for public use. This set of skills and experiences not only enriched my technical repertoire, but also enabled a significant contribution to innovation in a large organization, highlighting the relevance and impact of my work.
pt: No contexto de uma equipe focada no mercado internacional, desempenhei um papel significativo na customização e criação de softwares para atender às necessidades específicas de clientes corporativos para o mercado internacional. Como o principal desenvolvedor da equipe no contexto de tecnologias Web, atuei em um projeto de grande envergadura voltado para a modernização tecnológica, que consistiu na transformação de programas desktop tradicionais em aplicações web sofisticadas e adaptadas para o mercado internacional. Durante esse período, aprimorei substancialmente minhas habilidades no uso dos frameworks Angular e AngularJS, aplicando linguagens de programação como TypeScript e HTML para desenvolver soluções robustas e eficientes. Minha experiência também incluiu o desenvolvimento de APIs utilizando a linguagem Progress4GL, o que facilitou a integração de bancos de dados ao novo ambiente web de forma eficiente. Adicionalmente, tive a oportunidade de explorar o PO-UI, um framework de interface gráfica proprietário da empresa, que também é disponibilizado para o uso público. Este conjunto de habilidades e experiências não só enriqueceu meu repertório técnico, mas também possibilitou uma contribuição significativa para a inovação em uma organização de grande porte, destacando a relevância e o impacto do meu trabalho.

source: Language
pt: Idioma

source: Read more
pt: Ler mais

source: Read less
pt: Ler menos

# headerGreeting
source: Hi there, I'm
pt: Olá, eu sou

# headerTitle
source: Mobile Software Developer
pt: Desenvolvedor de Software Mobile

# developedBy
source: Developed by Bruno Marchi Pires
pt: Desenvolvido por Bruno Marchi Pires

source: Phone
pt: Telefone
